[
	{
		"id": "HowDemandingAre2018",
		"type": "report",
		"abstract": "This paper presents new information on activity-related eligibility criteria for unemployment and related benefits in OECD- and EU-countries in 2017, comparing the strictness of “demanding” elements built into unemployment benefits across countries and over time. Eligibility criteria for unemployment benefits determine what claimants need to do to successfully claim benefits initially or to continue receiving them. Benefit systems feature specific rules that define the type of job offers that claimants need to accept, requirements for reporting on the outcomes of independent job-search efforts, obligations to participate in active labour market programmes, as well as sanctions for failing to meet these requirements. Such rules aim to strengthen incentives to look for, prepare for, and accept employment. They may also be used as a targeting device to reduce demands on benefit systems, and on associated employment services. While this may serve to limit support to genuine jobseekers, strict requirements can also exclude some intended recipients from financial and re-employment support, e.g., by discouraging them from applying. This paper presents detailed information on policy rules in 2017, summarises them into an overall policy indicator of eligibility strictness, and gauges recent policy trends by documenting changes in the strictness measures. A novelty is the inclusion of lower-tier unemployment or social assistance benefits in the compilation of policy rules. Results document a large number of reforms enacted after the Great Recession and suggest a slight convergence of policy rules across countries even though overall measures of the strictness of activity-related eligibility criteria have remained broadly unchanged during the recent past. In countries with multiple layers of support for the unemployed, availability requirements tend to be more demanding for lower-tier assistance benefits, while sanction rules tend to be more stringent for first-tier programmes.",
		"genre": "OECD Social, Employment and Migration Working Papers",
		"language": "en",
		"note": "collection-title: OECD Social, Employment and Migration Working Papers\nvolume: 215\nDOI: 10.1787/2bdfecca-en",
		"number": "215",
		"source": "DOI.org (Crossref)",
		"title": "How demanding are activation requirements for jobseekers",
		"URL": "https://www.oecd-ilibrary.org/employment/how-demanding-are-activation-requirements-for-jobseekers_2bdfecca-en",
		"accessed": {
			"date-parts": [
				[
					"2020",
					12,
					23
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2018",
					7,
					11
				]
			]
		}
	}
]