[
  {
    "path": "posts/reading-list/",
    "title": "Reading List",
    "description": "Here's a list of articles I'm working on.",
    "author": [],
    "date": "2021-06-17",
    "categories": [
      "policy research"
    ],
    "contents": "\nIn no particular order:\n(Bransch 2021)\n(Bowlus et al., n.d.)\n(Moslimani, n.d.)\n(Noy, n.d.)\n(“Providing Public Workforce Services to Job Seekers: 30-Month Impact Findings on the WIA Adult and Dislocated Worker Programs,” n.d.)\n(Myers, Harding, and Pasolli, n.d.)\n(Draheim, Schanbacher, and Seiberlich 2021)\n(Deming 2021)\n(Hyggen and Vedeler 2021)\n\n\n\nBowlus, Audra J, Lance Lochner, Chris Robinson, and Eda Suleymanoglu. n.d. “2021-3 Wages, Skills, and Skill-Biased Technical Change: The Canonical Model Revisited,” 45.\n\n\nBransch, Felix. 2021. “Job Search Intensity of Unemployed Workers and the Business Cycle.” Economics Letters 205 (August): 109927. https://doi.org/10.1016/j.econlet.2021.109927.\n\n\nDeming, David. 2021. “The Growing Importance of Decision-Making on the Job.” w28733. Cambridge, MA: National Bureau of Economic Research. https://doi.org/10.3386/w28733.\n\n\nDraheim, Matthias, Peter Schanbacher, and Ruben Seiberlich. 2021. “On the Effectiveness of Case Management for People with Disabilities.” Journal for Labour Market Research 55 (1): 15. https://doi.org/10.1186/s12651-021-00299-9.\n\n\nHyggen, Christer, and Janikke Solstad Vedeler. 2021. “Employer Engagement and Active Labour Market Policies. Evidence from a Norwegian Multi-Method Study.” Social Policy and Society, March, 1–13. https://doi.org/10.1017/S1474746420000421.\n\n\nMoslimani, Mohamad. n.d. “Understanding Place-Based Immigration: The Proposal, Its Popularity, and Its Prospects,” 78.\n\n\nMyers, Karen, Simon Harding, and Kelly Pasolli. n.d. “Skills Training That Works: Lessons from Demand-Driven Approaches,” 30.\n\n\nNoy, Shakked. n.d. “Involuntary Job Loss: Welfare Effects, Earnings Impacts and Policy Options,” 50.\n\n\n“Providing Public Workforce Services to Job Seekers: 30-Month Impact Findings on the WIA Adult and Dislocated Worker Programs.” n.d., 180.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-17T21:38:28-04:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-job-seeker-strategies/",
    "title": "Notes on Job Seeker Strategies",
    "description": "A review of a paper that examines adjustment strategies.",
    "author": [],
    "date": "2021-03-21",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nOverview\nFindings\nHighlights\n\nOverview\n(Morissette n.d. et. al.) use Statcan’s Longitudinal Worker File (LWF) with Census file and Apprenticeship data to examine four adjustment strategies for displaced workers:\nRegional mobility\nPSE enrollment\nApprenticeship enrollment\nSelf-Employment\nFindings\nOnly 1 in 5 adopt any strategy whatsoever (!)\nIn the first year after job loss, enrolling in PSE was the predominant strategy for women; men predominantly moved to another region. Five years after job loss, moving became the main strategy for both genders.\nOlder workers were less likely to move to another region or invest in skills, in both the short and long terms. They were also less likely to become self- employed in the long term. n Workers with more education were more likely to pursue PSE, especially if they already had university education, as well as more likely to become self-employed.\nIn both the short and long terms, immigrants — especially women — were less likely to move to another region than workers born in Canada. Immigrants were also less likely to enrol in apprenticeships five years after job loss. Recent immigrant men were more likely to start a business than their Canadian-born counterparts in the long term.\nMen with at least three years of job tenure were less likely to move than were men with fewer years on the job, in both the short and long terms. Those with six or more years of job tenure were more likely to invest in PSE in the short term. n Workers laid off from small firms (fewer than 20 employees) were, all else be- ing equal, more likely to start their own businesses in the short and long terms.\nHighlights\n\n“The use of adjustment strategies varied considerably depending on gender, age, education and other characteristics. For instance, in the first year after job loss, the most common strategy among laid-off women was to enrol in post-secondary education, whereas among men it was to move to another region. Five years after job loss, moving was the predominant strategy for both genders” ( :4)\n\n\n“Finally, should we be concerned if the majority of displaced workers fail to adopt any adjustment strategy? If it is because most of them find new jobs soon after job loss, that is one thing — a good news story. But if they remain unemployed for some time, perhaps the programs and policies meant to support labour market adjustment have limitations that prevent people from using them. Without comparable data on a range of adjustment strategies, these questions cannot even be raised.” ( :8)\n\n\n“Remarkably, three quarters of the displaced workers who were still without jobs in 2010 did not adopt any strategy that first year. Some of them — for example, longtenured ones — might have been waiting for job offers that paid as well as their previous jobs and, as a result, joined the ranks of the long-term unemployed. Others might have left the labour force temporarily because they were discouraged workers” ( :17)\n\n\n“Overall, only a minority of displaced workers — at most one out of five — adopted at least one adjustment strategy in either the first or the fifth year after job loss” ( :24)\n\n\n“The main finding here is that job loss does not appear to induce — either in the short or the long term — a large behavioural response in terms of an increased use of the four strategies considered in this study. This result is consistent with the fact that, even during tough times, the vast majority of displaced workers find a paid job — albeit one that often pays less than the previous one — shortly after job loss” ( :25)\n\n\n\n\nMorissette, René. n.d. “Adjusting to Job Loss When Times Are Tough.” IRPP. Accessed March 3, 2021. https://irpp.org/research-studies/adjusting-to-job-loss-when-times-are-tough/.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-22T21:56:50-04:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-randomization-in-almps/",
    "title": "Notes on Randomization",
    "description": "A short review of papers where randomization is used in the evaluation of active labour market programs.",
    "author": [],
    "date": "2021-02-14",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nMeta evaluations\nAccess to services\nProgram components\n\nMeta evaluations\n(Yeyati, Montané, and Sartorio, n.d.) undertake a meta-evaluation of active labour market policies where RCTs were the only evaluation method/experimental design. They note that RCTs in ALMP evaluations have exploded since 2014. (Card, Kluve, and Weber 2015) report that roughly 10% of ALMP evaluations used RCTs - by 2019 that number was 20% and rising.\n\nAccess to services\n(Katz et al. 2020) evaluate the impact of sector-based labour market programs in four different randomized trials (where access to the program was randomized) in three different US areas (NYC, Tulsa, Northeast Ohio)\nWorkAdvance model:\n– Per Scholas (NYC) - IT sector\n– Towards Employment (NE Ohio) health care sector and manufacturing\n– Madison strategies (Tulsa, Oklahoma), transportation and manufacturing\nOutcomes mostly looking at earnings and attachment.\n(Cheung et al. 2019) randomize access to the delivery of job search assistance at different service delivery sites in Sweden to show the impact of job search assistance alone. Many studies have trouble detecting the impact of just job search assistance vs other components like training (doubling caseworker meeting frequency was the program)\nProgram components\n(Belot, Kircher, and Muller 2019) also show that randomization within components of service is useful. They randomize Scottish clients use of a digital job search tool which expands the occupations and structure of job search to demonstrate increasing job search effort / intensity / matching and payoff. (Briscese, Zanella, and Quinn 2020) do something very similar in Australia using the jobactive program; they randomize the use of standardized templates for resume and cover letters which demonstrate that the use of these tools improve job search success. Finally, from the University of Alberta, (Wheeler et al. 2019) undertake a similar RCT in large South African cities; randomizing access to LinkedIn and measuring the effect on job search outcomes and informational frictions.\n(Bolhaar, Ketel, and Klaauw 2018) use a clever RCT design to randomize how caseworkers assign social assistance recipients to different types of interventions, demonstrating, among other things, that more outcomes are captured if less discretion is extended to caseworkers in the Netherlands.\n\n\n\nBelot, Michèle, Philipp Kircher, and Paul Muller. 2019. “Providing Advice to Jobseekers at Low Cost: An Experimental Study on Online Advice.” The Review of Economic Studies 86 (4): 1411–47. https://doi.org/10.1093/restud/rdy059.\n\n\nBolhaar, Jonneke, Nadine Ketel, and Bas van der Klaauw. 2018. “Caseworker’s Discretion and the Effectiveness of Welfare-to-Work Programs.” Working Paper 11666. IZA Discussion Papers. https://www.econstor.eu/handle/10419/185126.\n\n\nBriscese, Guglielmo, Giulio Zanella, and Veronica Quinn. 2020. “Improving Job Search Skills: A Field Experiment on Online Employment Assistance.” Working Paper 13170. IZA Discussion Papers. https://www.econstor.eu/handle/10419/216482.\n\n\nCard, David, Jochen Kluve, and Andrea Weber. 2015. “What Works? A Meta Analysis of Recent Active Labor Market Program Evaluations.” w21431. Cambridge, MA: National Bureau of Economic Research. https://doi.org/10.3386/w21431.\n\n\nCheung, Maria, Johan Egebark, Anders Forslund, Lisa Laun, Magnus Rodin, and Johan Vikström. 2019. “Does Job Search Assistance Reduce Unemployment? Experimental Evidence on Displacement Effects and Mechanisms.” SSRN Electronic Journal. https://doi.org/10.2139/ssrn.3515935.\n\n\nKatz, Lawrence, Jonathan Roth, Richard Hendra, and Kelsey Schaberg. 2020. “Why Do Sectoral Employment Programs Work? Lessons from WorkAdvance.” w28248. Cambridge, MA: National Bureau of Economic Research. https://doi.org/10.3386/w28248.\n\n\nWheeler, Laurel E, Robert Garlick, Eric Johnson, Patrick Shaw, and Marissa Gargano. 2019. “Linkedin(to) Job Opportunities: Experimental Evidence from Job Readiness Training.” SSRN Electronic Journal. https://doi.org/10.2139/ssrn.3452249.\n\n\nYeyati, Eduardo Levy, Martín Montané, and Luca Sartorio. n.d. “What Works for Active Labor Market Policies?” 28. https://www.hks.harvard.edu/centers/cid/publications/faculty-working-papers/labor-market-policies.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-14T15:00:44-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-sectoral-programs/",
    "title": "Notes on Sectoral Programs",
    "description": "A review of an RCT-based meta-evaluation of sectoral based employment programs",
    "author": [],
    "date": "2021-01-02",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nOverview\nFindings\nHighlights\n\nOverview\nKatz et al. (2020) review key RCT evaluations for sectoral based employment programs - WorkAdvance as implemented in a variety of different US areas\nOutcome is increased earnings with a focus on persistence; (how long do the effects on earnings last?) and value for money (program costs vs outcomes)\nThe authors first review the components of sectoral programs, review findings and advance a theoretical discussion on what mechanisms are at work that make these programs successful. Here they offer three possibilities:\nthe market simply under-provides training, and so any additional training is a net benefit\nsector-focused training providers are more attuned to employer needs and can therefore design programs that build participants’ human capital faster\nit could be less about being sector-based and more about the wrap-around services that are built into the program design\n\nFindings\ntreatment gets participants into higher-earning industries and occupations, and these gains appear to be primarily associated with increased work in the targeted sector\nthe sustained positive earnings gains suggest that mechanism #1 is most likely at play\nthere is evidence that suggests that wrap-around services are a key component to success but it is not conclusive, although other ALMPs meta-evaluations have demonstrated this success\nthis is a challenge for ALMP practioners because if it’s not clear that the sector-component alone is responsible for the lasting effects, value-for-money comparisons will need to include more traditional delivery of ALMP programming in order to assess policy implications.\n\nif the mechanism at play is placement + wrap-around support how should we consider sector-based strategies relative to the traditional delivery of employment services?\nHighlights\n\n“The pathways to jobs at high-wage employers appear to be increasingly perilous for noncollege workers as seen in a rise in the correlation of firm wage premiums with worker education and worker wage fixed effects” (Katz et al 2020:3)\n\n\n“Sector-focused training programs train job seekers for”high-quality\" employment in specific industries and occupational clusters that are believed to have strong current local labor demand and opportunities for longer-term career advancement. Targeted sectors typically have included health care, information technology (IT), and manufacturing. A goal is to open the doors for individuals with non-traditional backgrounds to assist them in attaining highwage jobs in the targeted sectors. T\" (Katz et al 2020:3)\n\n\n“The sector-focused programs evaluated in these four RCTs generate substantial earnings gains from 14 to 39 percent the year or so following training completion. And all three evaluations with available longer-term follow-ups (WorkAdvance for six years after random assignment, Project Quest for nine years, and Year Up for three years) show substantial persistence of the early earnings gains with little evidence of the fade out of treatment impacts found in many evaluations of past employment programs. Sectorfocused programs appear to generate persistent earnings gains by moving participants into jobs with higher hourly wages rather than mainly by increasing employment rates.” (Katz et al 2020:4)\n\n\n“WorkAdvance substantially served to raise earnings through improved job quality as measured by higher average earnings in the occupations and industries of the treatment group than the control group” - “suggestive evidence that the occupational and soft skills training components are crucial and the earnings impacts don’t just reflect screening and placement services.” (Katz et al 2020:5)\n\n\n“Each RCT randomized access to a sectoral employment program among eligible applicants who had passed pre-enrollment screens” (Katz et al 2020:5)\n\n\n“The core idea behind sectoral employment programs is that improvements in employment-related skills strategically directed towards areas of strong (and rising) labor demand combined with intermediaries to break down barriers to employment for workers with non-traditional backgrounds for the targeted jobs should lead to durable earnings gains and advancement in the labor market” (Katz et al 2020:5)\n\n\n“The common elements of the WorkAdvance model include (i) screening before enrollment to make sure participants can take advantage of the offered skills training; (ii) sector-appropriate pre-employment and career readiness services; (iii) sector-specific occupational skills training; (iv) sector-specific job development and placement services; and (v) postemployment retention and advancement services with providers attempting to maintain close continuing contact with placed participants and their employers” - “screening role for motivation and possibly other soft skills.” (Katz et al 2020:6)\n\n\n“collected data on participant outcomes from follow-up surveys ranging from 18 months after random assignment for Year Up to around two years after for WorkAdvance and SEIS to six years after for Project Quest. And the WorkAdvance, Project Quest, and Year Up evaluations also collected administrative earnings records for longer-term tracking of employment outcomes” (Katz et al 2020:8)\n\n\n“all the programs studied in the four evaluations generated substantial and statistically significant increases in credential and certification attainment relevant to the targeted sector” (Katz et al 2020:8)\n\n\n“earnings impacts using Texas state administrative earnings data are modestly negative in the first two years after random assignment, turn positive (but not significantly so) in Year 3, become larger and statistically significantly positive in Years 4 to 6 reaching 21 percent in Year 6 and persisting at 18 percent into Year 9” (Katz et al 2020:9)\n\n\n“earnings gains are substantially driven by increasing the share of participants working in higherwage jobs.” (Katz et al 2020:10)\n\n\n“Sector-focused training programs attempt to reduce human capital deficits through occupational skills, soft skills, and career readiness training. The programs also help overcome social capital deficits, employer discrimination, and limited job referral networks through pre-employment services and a brokering and vouching role with employers as intermediaries in the job development and placement process.” (Katz et al 2020:12)\n\n\n“The post-placement involvement of program staff may also better allow participants to overcome problems of supervisor implicit bias and discrimination against minority a” (Katz et al 2020:13)\n\n\n“First, our analysis demonstrates clearly that WorkAdvance treatment gets participants into higher-earning industries and occupations, and these gains appear to be primarily associated with increased work in the targeted sector” - “Second, the sustained positive earnings gains from WorkAdvance through year 6 after random assignment - and for Project Quest through year 9 – suggest that the gains from sectoral training programs are not merely the result of smoothing over transitory shocks in labor demand, at least if transitory is defined on the time-scale of 5-10 years” - “Third, we interpret both the anecdotal and empirical evidence from the early cohorts at Madison Strategies and Towards Employment, in which some participants were provided wraparound services without sectoral training, as suggestive evidence against the hypothesis that the wraparound services are the main component of the earnings gains from these programs. This evidence must be interpreted with some caution, however, given that the placement-first model was not randomly assigned and the differences across cohorts are imprecisely estimated” (Katz et al 2020:24)\n\n\n“Persistent earnings gains from programs emphasizing human capital accumulation in addition to support services as compared to those more focused on job search assistance and early job placement is a systematic pattern documented in the cross-country meta-analysis of active labor market program evaluations by Card, Kluve, and Weber (2018)” (Katz et al 2020:24)\n\n\n“Sectoral employment programs have proven successful in improving the earnings trajectories for low-wage workers without college degrees but with sufficient motivation and basic skills (testing at 6th to 10th grade level and with a high school degree or GED) to gain program entry” (Katz et al 2020:25)\n\n\n“Crucial research questions going forward are how effective are remote as compared to in-person versions of sectoral employment programs and whether remote versions will allow the more rapid and lowercost scaling up of successful evidence-based training programs” (Katz et al 2020:25)\n\n\n\n\nKatz, Lawrence, Jonathan Roth, Richard Hendra, and Kelsey Schaberg. 2020. “Why Do Sectoral Employment Programs Work? Lessons from WorkAdvance.” w28248. Cambridge, MA: National Bureau of Economic Research. http://www.nber.org/papers/w28248.pdf.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-02T10:55:35-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-caseworker-discretion/",
    "title": "Notes on Caseworker Discretion",
    "description": "A short review of research related to caseworker discretion in program assignment",
    "author": [],
    "date": "2020-10-11",
    "categories": [
      "policy research"
    ],
    "contents": "\nBolhaar, Ketel, and van der Klaauw (2018)\ndirect matching to vacancies improves exit\nprogram participation leads to worse outcomes including compared to offering no guidance\ncaseworkers, even with information on effectiveness make non-optimal assignments, reducing discretion makes sense\nHuber, Lechner, and Mellace (2016)\nresearch indicates less accommodating caseworkers are more successful in placing people in employment\nthe results are due less to effective program mix of interventions are more to threat of sanctions\nLechner and Smith (2007)\ncaseworker do not efficiently assign clients to interventions based on effectiveness\ndistortions in the decision-process could have a number of reasons;\nlack appropriate knowledge\ngoals other than efficiency\ninterference from other regulations\n\n\n\nBolhaar, Jonneke, Nadine Ketel, and Bas van der Klaauw. 2018. “Caseworker’s Discretion and the Effectiveness of Welfare-to-Work Programs.” Working Paper 11666. IZA Discussion Papers. https://www.econstor.eu/handle/10419/185126.\n\n\nHuber, Martin, Michael Lechner, and Giovanni Mellace. 2016. “Why Do Tougher Caseworkers Increase Employment? The Role of Program Assignment as a Causal Mechanism.” The Review of Economics and Statistics 99 (1): 180–83. https://doi.org/10.1162/REST_a_00632.\n\n\nLechner, Michael, and Jeffrey Smith. 2007. “What Is the Value Added by Caseworkers?” Labour Economics 14 (2): 135–51. https://doi.org/10.1016/j.labeco.2004.12.002.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:25:30-05:00",
    "input_file": {}
  },
  {
    "path": "posts/creating-tables-again/",
    "title": "Creating Tables Again",
    "description": "Exploring reactable to build high quality tables for publication.",
    "author": [],
    "date": "2020-07-05",
    "categories": [
      "code"
    ],
    "contents": "\nPreviously I took a look at the gt package. Now I’m seeing what I can make of reactables another interesting way to generate html tables. I’ll be using the latest tidytues dataset on x-men!\nLoad in the data\n\n\nlibrary(tidyverse)\n\n\n\n\nShow code\ncharacter_visualization <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-06-30/character_visualization.csv')\n\n\n\nMake a table. I’ll note I’m not digging too deep into the x-men content here; I’m just looking for an easy table structure.\n\n\ntop_speech <- character_visualization %>% \n  filter(!(character %in% c(\"Editor narration\", \"Omnipresent narration\"))) %>% \n  group_by(character) %>% \n  summarize(across(speech:depicted, sum)) %>% \n  slice_max(order_by = speech, n = 15) %>% \n  separate(character, into = c(\"hero\", \"real_name\"), sep = \" = \") %>% \n  mutate(pct_speech = speech/sum(speech)) %>% \n  arrange(desc(pct_speech)) %>% \n  select(-real_name) %>% \n  select(hero, pct_speech, everything()) %>% \n  mutate(pct_speech = round(pct_speech, 3))\n\n\n\nI added this css after the fact.\n\n\n.x-men {\n  margin: 0 auto;\n  width: 750px;\n  font-family: Karla, \"Helvetica Neue\", Helvetica, Arial, sans-serif;\n  font-size: 14px;\n}\n\n\n.x-men {\n  margin: 0 auto;\n  width: 750px;\n  font-family: Karla, \"Helvetica Neue\", Helvetica, Arial, sans-serif;\n  font-size: 14px;\n}\n\n\nRender the table\n\n\nlibrary(reactable)\nlibrary(htmltools)\n\n\n# Render a bar chart with a label on the left\nbar_chart <- function(label, \n                      width = \"100%\", \n                      height = \"14px\", \n                      fill = \"#00bfc4\", \n                      background = NULL) {\n  bar <- div(style = list(background = fill, width = width, height = height))\n  chart <- div(style = list(flexGrow = 1, marginLeft = \"6px\", background = background), bar)\n  div(style = list(display = \"flex\", alignItems = \"center\"), label, chart)\n}\n\ncol_groups = c(\"speech\", \"thought\", \"narrative\", \"depicted\")\n\nreactable(top_speech,\n          compact = TRUE,\n          class = \"x-men\",\n          defaultSorted = \"pct_speech\",\n          highlight = TRUE,\n          defaultColDef = colDef(headerClass = \"header\", align = \"left\"),\n          columnGroups = list(\n            colGroup(name = \"Representation Type\", columns = col_groups)\n          ),\n          columns = list(\n            hero = colDef(name = \"X-Men Hero\",\n                        minWidth = 170,\n                        style = list(fontWeight = 500)),\n            speech = colDef(name = \"Speech\",\n                            format = colFormat(separators = TRUE)),\n            thought = colDef(name = \"Thought\",\n                             format = colFormat(separators = TRUE)),\n            narrative = colDef(name = \"Narrative\",\n                               format = colFormat(separators = TRUE)),\n            depicted = colDef(name = \"Depicted\",\n                              format = colFormat(separators = TRUE)),\n            pct_speech = colDef(\n              name = \"Proportion of Speech\",\n              minWidth = 150,\n              defaultSortOrder = \"desc\",\n              cell = function(value) {\n              value <- paste0(format(value * 100, nsmall = 1), \"%\")\n              value <- format(value, width = 5, justify = \"right\")\n              bar_chart(value, width = value, fill = \"#fc5185\", background = \"#e1e1e1\")\n            },\n            align = \"left\",\n            style = list(fontFamily = \"monospace\", whiteSpace = \"pre\")\n          )))\n\n\n\n{\"x\":{\"tag\":{\"name\":\"Reactable\",\"attribs\":{\"data\":{\"hero\":[\"Wolverine\",\"Storm\",\"Cyclops\",\"Colossus\",\"Rogue\",\"Ariel/Sprite/Shadowcat\",\"Nightcrawler\",\"Psylocke\",\"Professor X\",\"Marvel Girl/Phoenix\",\"Havok\",\"Dazzler\",\"Forge\",\"Magneto\",\"Phoenix(2)\"],\"pct_speech\":[0.157,0.152,0.089,0.078,0.078,0.073,0.064,0.05,0.049,0.041,0.039,0.038,0.035,0.028,0.028],\"speech\":[3640,3517,2052,1800,1800,1690,1492,1163,1128,957,902,875,818,651,651],\"thought\":[532,1900,729,461,611,737,441,159,269,195,238,565,131,74,469],\"narrative\":[352,99,193,6,49,66,6,109,175,2,172,5,118,176,40],\"depicted\":[3537,4169,2223,2712,1603,1714,1839,993,1095,1012,779,896,588,552,680]},\"columns\":[{\"accessor\":\"hero\",\"name\":\"X-Men Hero\",\"type\":\"character\",\"align\":\"left\",\"headerClassName\":\"header\",\"minWidth\":170,\"style\":{\"fontWeight\":500}},{\"accessor\":\"pct_speech\",\"name\":\"Proportion of Speech\",\"type\":\"numeric\",\"align\":\"left\",\"headerClassName\":\"header\",\"defaultSortDesc\":true,\"cell\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\"15.7%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\"15.7%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\"15.2%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\"15.2%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 8.9%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 8.9%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 7.8%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 7.8%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 7.8%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 7.8%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 7.3%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 7.3%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 6.4%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 6.4%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 5.0%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 5.0%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 4.9%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 4.9%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 4.1%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 4.1%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 3.9%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 3.9%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 3.8%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 3.8%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 3.5%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 3.5%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 2.8%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 2.8%\",\"height\":\"14px\"}},\"children\":[]}]}]},{\"name\":\"div\",\"attribs\":{\"style\":{\"display\":\"flex\",\"alignItems\":\"center\"}},\"children\":[\" 2.8%\",{\"name\":\"div\",\"attribs\":{\"style\":{\"flexGrow\":1,\"marginLeft\":\"6px\",\"background\":\"#e1e1e1\"}},\"children\":[{\"name\":\"div\",\"attribs\":{\"style\":{\"background\":\"#fc5185\",\"width\":\" 2.8%\",\"height\":\"14px\"}},\"children\":[]}]}]}],\"minWidth\":150,\"style\":{\"fontFamily\":\"monospace\",\"whiteSpace\":\"pre\"}},{\"accessor\":\"speech\",\"name\":\"Speech\",\"type\":\"numeric\",\"align\":\"left\",\"headerClassName\":\"header\",\"format\":{\"cell\":{\"separators\":true},\"aggregated\":{\"separators\":true}}},{\"accessor\":\"thought\",\"name\":\"Thought\",\"type\":\"numeric\",\"align\":\"left\",\"headerClassName\":\"header\",\"format\":{\"cell\":{\"separators\":true},\"aggregated\":{\"separators\":true}}},{\"accessor\":\"narrative\",\"name\":\"Narrative\",\"type\":\"numeric\",\"align\":\"left\",\"headerClassName\":\"header\",\"format\":{\"cell\":{\"separators\":true},\"aggregated\":{\"separators\":true}}},{\"accessor\":\"depicted\",\"name\":\"Depicted\",\"type\":\"numeric\",\"align\":\"left\",\"headerClassName\":\"header\",\"format\":{\"cell\":{\"separators\":true},\"aggregated\":{\"separators\":true}}}],\"columnGroups\":[{\"name\":\"Representation Type\",\"columns\":[\"speech\",\"thought\",\"narrative\",\"depicted\"]}],\"defaultSorted\":[{\"id\":\"pct_speech\",\"desc\":true}],\"defaultPageSize\":10,\"paginationType\":\"numbers\",\"showPageInfo\":true,\"minRows\":1,\"highlight\":true,\"compact\":true,\"className\":\"x-men\",\"dataKey\":\"768eefd78e4edb491da5b639010dafbb\",\"key\":\"768eefd78e4edb491da5b639010dafbb\"},\"children\":[]},\"class\":\"reactR_markup\"},\"evals\":[],\"jsHooks\":[]}\nIt’s super buggy using blogdown. At first I couldn’t render the table using a .Rmarkdown file. Once I switched to an .Rmd it seemed to work. Seems like a great table making library.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:22:14-05:00",
    "input_file": {}
  },
  {
    "path": "posts/making-tables/",
    "title": "Making Tables",
    "description": "A quick review of the gt package for making tables",
    "author": [],
    "date": "2020-06-28",
    "categories": [
      "code"
    ],
    "contents": "\nI’ve wanted to dive into the gt package for making tables for awhile now. Here is a quick example of a table using data from a tidy tuesday a few weeks back. It seems my hugo theme is over-writing some of the table css, I’ll have to check that out.\n\n\nlibrary(tidyverse)\n\nlibrary(gt)\n\n\n\n\n\n\n\n\ntable>tbody>tr:nth-child(odd)>td, table>tbody>tr:nth-child(odd)>th {\n    background-color: #fff;\n}\ntable > tbody > tr:hover > td,\ntable > tbody > tr:hover > th {\n  background-color: #fff;\n}\n.article-style img, .article-style video {\n  height: auto;\n  margin-left: auto;\n  margin-right: auto;\n  margin-top: 0;\n  margin-bottom: 0;\n  padding: 0;\n}\n\nLet’s read in the cocktails recipie\n\nShow code\nboston_cocktails <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-05-26/boston_cocktails.csv') %>% \n  janitor::clean_names()\n\n\n\nLet’s make the data reasonable!\n\n\nboston_tidy <- boston_cocktails %>% \n  # fix the measurements\n  separate(measure, into = c('value', 'measurement'), sep = \" \", remove = FALSE) %>% \n  # remove values that don't have properly formed measurements crudely\n  filter(measurement == \"oz\") %>% \n  # convert fractions to decimals\n  mutate(value = case_when(\n    value == \"1/2\" ~ \".5\",\n    value == \"1/3\" ~ \".33\",\n    value == \"1/4\" ~ \".25\",\n    value == \"3/4\" ~ \".74\",\n    TRUE ~ value\n  )) %>% \n  # magic\n  type_convert() %>% \n  # only keep realistic values\n  filter(value <= 5)\n\nboston_table <- boston_tidy%>% \n  filter(!category %in% c('Non-alcoholic Drinks', 'Rum', 'Shooters')) %>% \n  group_by(category, name) %>% \n  summarize(total_ingredients = which.max(ingredient_number),\n            total_ounces = sum(value)) %>% \n  arrange(category, desc(total_ingredients)) %>% \n  slice_head(n = 5) %>% \n  arrange(category) %>% \n  ungroup()\n\n\n\nmake the table\n\n\nboston_gt_table <- gt(boston_table, \n                      rowname_col = \"name\",\n                      groupname_col = \"category\")\n\n\nboston_gt_table <- boston_gt_table %>% \n  tab_header(\n    title = \"Top cocktails by Category\",\n    subtitle = \"Top 5 cocktails based on number of ingredients\"\n  ) %>% \n  tab_spanner(label = \"Drink Information\",\n              columns = vars(\"total_ingredients\", \"total_ounces\")) %>% \n  cols_label(\n    total_ingredients = \"Total Ingredients\",\n    total_ounces = \"Total Ounces\",\n    name = \"Name\"\n  ) %>% \n  summary_rows(\n    groups = TRUE,\n    columns = vars(total_ingredients, total_ounces),\n    fns = list(Total = \"sum\"),\n    formatter = fmt_number,\n    decimals = 2,\n    use_seps = TRUE\n  ) \n\nboston_gt_table %>% \n  tab_options(table.width = \"100%\",\n              table.font.size = \"smaller\",\n              data_row.padding = \"3px\") %>% \n  tab_source_note(\n    source_note = md(\"Data comes from the [Tidy Tuesday project](https://github.com/rfordatascience/tidytuesday/blob/master/data/2020/2020-05-26/readme.md)\")\n  ) %>% \n  opt_align_table_header(align = \"center\")\n\n\nhtml {\n  font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Helvetica Neue', 'Fira Sans', 'Droid Sans', Arial, sans-serif;\n}\n\n#iameszbczy .gt_table {\n  display: table;\n  border-collapse: collapse;\n  margin-left: auto;\n  margin-right: auto;\n  color: #333333;\n  font-size: smaller;\n  font-weight: normal;\n  font-style: normal;\n  background-color: #FFFFFF;\n  width: 100%;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #A8A8A8;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #A8A8A8;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n}\n\n#iameszbczy .gt_heading {\n  background-color: #FFFFFF;\n  text-align: center;\n  border-bottom-color: #FFFFFF;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#iameszbczy .gt_title {\n  color: #333333;\n  font-size: 125%;\n  font-weight: initial;\n  padding-top: 4px;\n  padding-bottom: 4px;\n  border-bottom-color: #FFFFFF;\n  border-bottom-width: 0;\n}\n\n#iameszbczy .gt_subtitle {\n  color: #333333;\n  font-size: 85%;\n  font-weight: initial;\n  padding-top: 0;\n  padding-bottom: 4px;\n  border-top-color: #FFFFFF;\n  border-top-width: 0;\n}\n\n#iameszbczy .gt_bottom_border {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#iameszbczy .gt_col_headings {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#iameszbczy .gt_col_heading {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 6px;\n  padding-left: 5px;\n  padding-right: 5px;\n  overflow-x: hidden;\n}\n\n#iameszbczy .gt_column_spanner_outer {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  padding-top: 0;\n  padding-bottom: 0;\n  padding-left: 4px;\n  padding-right: 4px;\n}\n\n#iameszbczy .gt_column_spanner_outer:first-child {\n  padding-left: 0;\n}\n\n#iameszbczy .gt_column_spanner_outer:last-child {\n  padding-right: 0;\n}\n\n#iameszbczy .gt_column_spanner {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 6px;\n  overflow-x: hidden;\n  display: inline-block;\n  width: 100%;\n}\n\n#iameszbczy .gt_group_heading {\n  padding: 8px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#iameszbczy .gt_empty_group_heading {\n  padding: 0.5px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#iameszbczy .gt_from_md > :first-child {\n  margin-top: 0;\n}\n\n#iameszbczy .gt_from_md > :last-child {\n  margin-bottom: 0;\n}\n\n#iameszbczy .gt_row {\n  padding-top: 3px;\n  padding-bottom: 3px;\n  padding-left: 5px;\n  padding-right: 5px;\n  margin: 10px;\n  border-top-style: solid;\n  border-top-width: 1px;\n  border-top-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n  overflow-x: hidden;\n}\n\n#iameszbczy .gt_stub {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-right-style: solid;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  padding-left: 12px;\n}\n\n#iameszbczy .gt_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#iameszbczy .gt_first_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n}\n\n#iameszbczy .gt_grand_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#iameszbczy .gt_first_grand_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: double;\n  border-top-width: 6px;\n  border-top-color: #D3D3D3;\n}\n\n#iameszbczy .gt_striped {\n  background-color: rgba(128, 128, 128, 0.05);\n}\n\n#iameszbczy .gt_table_body {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#iameszbczy .gt_footnotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#iameszbczy .gt_footnote {\n  margin: 0px;\n  font-size: 90%;\n  padding: 4px;\n}\n\n#iameszbczy .gt_sourcenotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#iameszbczy .gt_sourcenote {\n  font-size: 90%;\n  padding: 4px;\n}\n\n#iameszbczy .gt_left {\n  text-align: left;\n}\n\n#iameszbczy .gt_center {\n  text-align: center;\n}\n\n#iameszbczy .gt_right {\n  text-align: right;\n  font-variant-numeric: tabular-nums;\n}\n\n#iameszbczy .gt_font_normal {\n  font-weight: normal;\n}\n\n#iameszbczy .gt_font_bold {\n  font-weight: bold;\n}\n\n#iameszbczy .gt_font_italic {\n  font-style: italic;\n}\n\n#iameszbczy .gt_super {\n  font-size: 65%;\n}\n\n#iameszbczy .gt_footnote_marks {\n  font-style: italic;\n  font-size: 65%;\n}\nTop cocktails by Category\n    Top 5 cocktails based on number of ingredients\n    \n      \n        Drink Information\n      \n    Total Ingredients\n      Total Ounces\n    Brandy\n    Champs Elysees Cocktail\n      5\n      4.00\n    Cherry Blossom\n      5\n      2.50\n    D'artagnan\n      5\n      6.50\n    Deauville Cocktail\n      5\n      3.00\n    Gilroy Cocktail\n      5\n      3.48\n    Total\n      25.00\n      19.48\n    Cocktail Classics\n    Eye-Opener\n      6\n      6.50\n    Gloom Lifter\n      6\n      4.00\n    Hyatt's Jamaican Banana\n      6\n      5.50\n    New Orleans Gin Fizz\n      6\n      6.00\n    Prairie Oyster Cocktail\n      6\n      6.00\n    Total\n      30.00\n      28.00\n    Cordials and Liqueurs\n    Praire Oyster Cocktail\n      5\n      5.00\n    Absinthe Special Cocktail\n      2\n      1.25\n    Amaretto Rose\n      2\n      1.00\n    Amaretto Sour\n      2\n      1.24\n    Amber Amour\n      2\n      0.50\n    Total\n      13.00\n      8.99\n    Gin\n    The Winkle\n      6\n      11.00\n    Vow Of Silence\n      5\n      2.24\n    The Wink\n      4\n      4.50\n    Water Lily\n      4\n      2.96\n    Western Rose\n      4\n      3.00\n    Total\n      23.00\n      23.70\n    Rum - Daiquiris\n    Hai Karate\n      6\n      7.00\n    Ko Adang\n      6\n      5.00\n    Zombie\n      6\n      7.00\n    Floridita No. 3\n      5\n      4.24\n    Hush and Wonder\n      5\n      7.48\n    Total\n      28.00\n      30.72\n    Tequila\n    Amante Picante\n      6\n      10.00\n    Chupa Cabra\n      6\n      5.24\n    Flower Power\n      6\n      9.50\n    Oldest Temptation\n      6\n      5.25\n    The Nomad South\n      6\n      5.50\n    Total\n      30.00\n      35.49\n    Vodka\n    Ibiza\n      6\n      5.50\n    Long Island Iced Tea\n      6\n      4.20\n    Purple Passion Iced Tea\n      6\n      3.24\n    Sonic Blaster\n      6\n      4.50\n    Thyme Collins\n      6\n      10.00\n    Total\n      30.00\n      27.44\n    Whiskies\n    Blarney Stone Cocktail\n      6\n      5.50\n    California Lemonade\n      6\n      6.25\n    Carre Reprise\n      6\n      5.50\n    Chi-Town Flip\n      6\n      5.47\n    Double Standard Sour\n      6\n      3.73\n    Total\n      30.00\n      26.45\n    Data comes from the Tidy Tuesday project\n    \n\nMore to come!\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:24:02-05:00",
    "input_file": {}
  },
  {
    "path": "posts/dplyr-tricks/",
    "title": "dplyr tricks",
    "description": "A few lesser known dplyr functions that are super useful",
    "author": [],
    "date": "2020-06-07",
    "categories": [
      "code"
    ],
    "contents": "\n\nContents\nadd_count\ncrossing\nacross\n\nThe following is a list of functions that are super useful in the tidyverse that help solve a wide range of problems:\nadd_count\ncrossing\nacross\n\n\n# Get data from tidytues\n\nlibrary(tidyverse)\ncocktails <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-05-26/cocktails.csv')\n\n\n\nadd_count\nadds a count based on the variable supplied. Equivalent to group_by, summarize, ungroup.\n\n\ncocktails %>% \n  add_count(drink) %>% \n  select(row_id, drink, n) %>% \n  filter(n >= 8) %>% \n  distinct() %>% \n  knitr::kable()\n\n\nrow_id\ndrink\nn\n1\n1-900-FUK-MEUP\n8\n3\n151 Florida Bushwacker\n8\n8\n3-Mile Long Island Iced Tea\n8\n74\nAmaretto Liqueur\n11\n88\nAngelica Liqueur\n12\n91\nApple Cider Punch #1\n8\n106\nArizona Twister\n9\n110\nArtillery Punch\n8\n190\nCherry Electric Lemonade\n8\n197\nChocolate Monkey\n8\n231\nEgg Nog #4\n11\n366\nMasala Chai\n8\n425\nRadioactive Long Island Iced Tea\n8\n489\nSweet Sangria\n8\n\ncrossing\ngenerates all possible combinations of variables (like expand.grid, but returns a dataframe)\n\n\ncrossing(\n  a = 1:2,\n  b = c(\"a\", \"b\"),\n  c = c(\"x\", \"y\")) %>% \n  knitr::kable()\n\n\na\nb\nc\n1\na\nx\n1\na\ny\n1\nb\nx\n1\nb\ny\n2\na\nx\n2\na\ny\n2\nb\nx\n2\nb\ny\n\nacross\n\n\ncharacter_visualization <- readr::read_csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-06-30/character_visualization.csv')\n\n(top_speech <- character_visualization %>% \n  filter(!(character %in% c(\"Editor narration\", \"Omnipresent narration\"))) %>% \n  group_by(character) %>% \n  summarize(across(speech:depicted, sum)) %>% \n  slice_max(order_by = speech, n = 15) %>% \n  separate(character, into = c(\"hero\", \"real_name\"), sep = \" = \") %>% \n  mutate(pct_speech = speech/sum(speech)) %>% \n  arrange(desc(pct_speech)) %>% \n  select(-real_name) %>% \n  select(hero, pct_speech, everything()) %>% \n  mutate(pct_speech = round(pct_speech, 3)))\n\n\n# A tibble: 15 x 6\n   hero                   pct_speech speech thought narrative depicted\n   <chr>                       <dbl>  <dbl>   <dbl>     <dbl>    <dbl>\n 1 Wolverine                   0.157   3640     532       352     3537\n 2 Storm                       0.152   3517    1900        99     4169\n 3 Cyclops                     0.089   2052     729       193     2223\n 4 Colossus                    0.078   1800     461         6     2712\n 5 Rogue                       0.078   1800     611        49     1603\n 6 Ariel/Sprite/Shadowcat      0.073   1690     737        66     1714\n 7 Nightcrawler                0.064   1492     441         6     1839\n 8 Psylocke                    0.05    1163     159       109      993\n 9 Professor X                 0.049   1128     269       175     1095\n10 Marvel Girl/Phoenix         0.041    957     195         2     1012\n11 Havok                       0.039    902     238       172      779\n12 Dazzler                     0.038    875     565         5      896\n13 Forge                       0.035    818     131       118      588\n14 Magneto                     0.028    651      74       176      552\n15 Phoenix(2)                  0.028    651     469        40      680\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:22:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-allocating-resources/",
    "title": "Notes on Allocating Resources",
    "description": "A review of research related to allocation of resources in employment programs",
    "author": [],
    "date": "2020-06-06",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nTargeting vs ProfilingFindings\nHighlights\n\nProfiling as allocation method\n\nTargeting vs Profiling\n(Behncke, Frölich, and Lechner 2009) distinguish between two types of statisical approaches to resource allocation in ALMPs:\ntargeting which selects for each client the program with the highest expected outcome (based in the impact effect of each type of intervention), and;\nprofiling which based on a set of client characteristics, estimates the risk of becoming long term unemployed where those at the highest risk of being unemployed are assigned to the most intensive services\nThe authors suggest that targeting is preferable to profiling when:\nthere are a variety of types of programs/interventions offered, and/or;\nthe risk of long-term unemployed is not highly correlated with program impacts\nThe authors detail the challenges of maximizing the allocation of ALMPs in practice - namely:\nmoral hazard of employment agencies (contracting challenge, more on this here)\ncaseworkers have their own goals for clients (e.g. improving personal situation, long-term stability rather than rapid re-integration)\n\ncaseworker prediction (informational challenge)\nsmall sample sizes to build intuition on what works (no view of the system)\nno systematic evidence of outcomes/success (e.g. clients maye return but to a difference provider/caseworker)\n\nFindings\nThe authors review a pilot study in Switzerland where PES caseworkers were randomized into 2 groups, one who had access to statistical targeting tools and one where no prediction support was offered. The design was robust:\nrandomization at the caseworker level\n1 year study from 2005 to 2006\nover 18k jobseekers in the prediction group\nThe conclusions were as follows:\nthe statistical predictions offered had no impact on program assignment caseworkers made their own predictions and ignored the model\nincentives are required when caseworker discretion is at odds with the model\nHighlights\n\n“The evaluation results show that caseworkers did not change their behaviour in any significant way due to having access to the additional information” (Behncke et al :51)\n\n\n“the profiling systems often estimate the risk of becoming long-term unemployed if not taking part in ALMP” - “statistical targeting systems, which select for each client the programme with the highest expected outcome” (Behncke et al :53)\n\n\n“Small sample sizes are even more reduced by a limited capacity of caseworkers to follow-up on their clients after they are de-registered from the employment office.”- “there is evidence suggesting that caseworkers did not succeed in estimating employment probabilities between the various programmes or followed other aims than employment maximisation of their clients: Bell and Orr (2002) found that caseworkers did not systematically select those into treatment who would benefit most from it” (Behncke et al :54)\n\n\n“initiated a pilot study” - “where caseworkers were randomized either into the in or the out group.” (Behncke et al :57)\n\n\n“This is a big advantage vis-à-vis simple profiling models as it takes into account that the optimal time when a labour market programme should start may also vary across individuals.” (Behncke et al :61)\n\n\n“every second week by incorporating new information on time varying covariates” - “the number of months in stable employment in the next 12 months,” - “the conclusion is that the availability of the SAPS predictions had no impact on the actual choice of ALMP.” (Behncke et al :65)\n\n\n“first, caseworkers make their own predictions” - “ignored the econometric predictions either because of confidence in the superiority of their own judgements or because of unwillingness to comply with an external tool that could pose a potential threat to their future autonomy and discretion if introduced nationwide” (Behncke et al :66)\n\n\n“The evaluation results showed that caseworkers largely ignored the statistical support system” (Behncke et al :69)\n\n\n“Our evaluation results indicate that caseworker discretion may conflict with the provision of statistical targeting. In order to evaluate the impact of these systems, specific incentives may be required for caseworkers to comply. Bonus payments for caseworkers who complied with the experiment may be one example. These positive incentives should compensate for potential negative effects due to being unfamiliar with the system or being uncertain about its merits during the pilot phase” (Behncke et al :69)\n\nProfiling as allocation method\n(Berger, Black, and Smith 2001)\nThis research considers how to evaluate statistical profiling methods in allocation mechanisms for government programs.\nMore notes to come\n\n\n\nBehncke, Stefanie, Markus Frölich, and Michael Lechner. 2009. “Targeting Labour Market Programmes — Results from a Randomized Experiment.” Swiss Journal of Economics and Statistics 145 (3): 221–68. https://doi.org/10.1007/BF03399281.\n\n\nBerger, Mark C., Dan Black, and Jeffrey A. Smith. 2001. “Evaluating Profiling as a Means of Allocating Government Services.” In Econometric Evaluation of Labour Market Policies, edited by Michael Lechner and Friedhelm Pfeiffer, 13:59–84. Heidelberg: Physica-Verlag HD. https://doi.org/10.1007/978-3-642-57615-7_4.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:20:59-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-mutual-obligation/",
    "title": "Notes on Mutual Obligation",
    "description": "A review of research on activation requirements",
    "author": [],
    "date": "2020-05-17",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nOverviewEligibility Criteria\nFirst Tier eligibility criteria\nSecond Tier criteria\n\nInsights\nFigures\nHighlights\n\nOverview\nImmervol and Knotz (“How Demanding Are Activation Requirements for Jobseekers” 2018) provide a great working paper that evaluates the strictness of rules (eligibility criteria) that govern the receipt of benefits (first-tier/unemployment and second-tier/welfare) across OECD countries\nthey establish what types of eligibility criteria are common across countries\nthey surveyed each OECD country and derived a quantitative policy indicator of eligibility strictness of each scheme\nthey discuss the impacts of the eligibility choices on first and second tier benefits (for Canada, they used Ontario Works) and marginally discuss administrative provisions (how clients interact with administration)\nEligibility Criteria\nentitlement conditions: these are the rules set by the feds over which Ontario has little influence (e.g. how many hours of work before claim is established)\nactivity conditions - behavioural requirements that must be met by those who have an established right (‘entitlement’)\navailability criteria\navailability during ALMP participation (excuse for training/participation)\noccupational mobility - refuse based on NOC/less pay\ngeography\nother valid reasons - canada only labour dispute\n\njob-search and reporting criteria\nfrequency of job-search activity\ndocumentation of job-search\n\nsanctions for non-compliance\nvoluntary resignation / quit\nrefusal of suitable employment\nrepeated refusal of employment\nrefusal of ALMP participation\nrepeated refusal of ALMP participation\n\n\nFirst Tier eligibility criteria\njob search & reporting criteria vary strongly but availability criteria varies little to none\naustralia - job search now once a month and Denmark is entirely online\nCanada among lowest for job-search and reporting requirements\n\nSecond Tier criteria\navailability criteria represent biggest difference between first and second tier benefit types\ntwo types of jurisdictions - 1 where SA clients don’t qualify (see Germany) and could be Canada and 2 - where rules are mostly identical - see UK’s jobseekers allowance\nrules are often less strict here to give local authorities more leeway to design appropriate solutions\nInsights\nwarnings and sanctions generally are shown to shorten benefit duration and increase re-employment among those who may expect to incur a sanction (threat effects work)\nsoft constraints like mandatory participation in AMLPs or gradual reductions of benefits levels over time have similar effects to those of harsher instruments like sanctions and dis-entitlements\ngoal is to strengthen incentives to look/prepare for and accept employment and also target those more suitable\nFigures\n\nHighlights\n\n“Available meta-evaluations suggest that job-search assistance services and benefit sanctions are effective in yielding positive employment effects, especially if job loss has been relatively recent” (2018:9)\n\n\n“These additional aspects, including how unemployed workers apply for benefits and register for placement, are not commonly considered eligibility criteria. But they nonetheless shape the accessibility of benefits and play an important part in countries’ labour-market activation strategie” (2018:10)\n\n\n“for instance, shorter contribution records may be required or participation in ALMPs may generate new rights to unemployment insurance)” (2018:14)\n\n\n“These activity-related eligibility criteria are the subject of this paper and cover (i) requirements to be available for employment, (ii) job-search and reporting requirements, and (iii) sanctions for non-compliance with applicable requirements” (2018:14)\n\n\n“procedural aspects of how jobseekers interact with public authorities when they apply for benefits, register for job placement, arrange meetings, and obtain referrals to job vacancies” (2018:15)\n\n\n“they nonetheless shape the overall activation stance and the accessibility of support for the unemployed. Jobseekers may, for instance, only be able to sign up for unemployment benefits once they have registered for job placement with an employment service provider” (2018:15)\n\n\n“A number of studies have examined the impact of warnings and the existence of sanctions provisions generally and show that they can substantially shorten benefit claim durations and increase re-employment among individuals who may expect to incur a sanction” (2018:18)\n\n\n“More generally, there is evidence that”soft\" eligibility constraints like mandatory participation in ALMPs or gradual reductions of benefit levels over time have effects similar to those of harsher instruments like sanctions\" (2018:18)\n\n\n“a quantitative policy indicator on the strictness of benefit eligibility using data collected via comprehensive expert surveys” (2018:22)\n\n\n“Enforcement can vary even between countries with the same or very similar rules” (2018:22)\n\n\n“employment is when they participate in ALMPs such as labour market training schemes. For instance, it might be considered more important that claimants complete their courses first rather than having to accept available jobs quickly” (2018:23)\n\n\n“Claimants may be allowed to reject job offers if the vacancy is for an occupation that is different from their last job, or if it pays significantly lower wages.” (2018:23)\n\n\n“Claimants may also be required to commute or even relocate in order to acquire and start new employment. Many countries specify a maximum amount of time per day workplace or, alternatively, a maximum distance from their home a claimant can be required to commute to a new job.” (2018:23)\n\n\n“Other valid reasons.” (2018:23)\n\n\n“Across countries, scores for job-search reporting requirements and sanctions vary relatively strongly” (2018:30)\n\n\n“Australia and Denmark have relaxed job-search requirements.” (2018:30)\n\n\n“Denmark, job-search activities are now monitored via an online tool rather than during personal meetings.” (2018:30)\n\n\n“France, voluntary unemployment now may result in a complete disqualification from benefit receipt” (2018:31)\n\n\n\"Tighter sanctions now apply for initial and repeated refusals of job offers, as well as for repeated refusals to participate in ALMPs.\" (2018:31)\n\n\n“Canada significantly amended its regulations on suitable work, which now includes relaxed occupational mobility requirements but also additional demands regarding geographical mobility along with a” (2018:31)\n\n\n“shorter list of other valid reasons for refusing a job offer. Overall, this manifests itself in an overall slightly higher score compared to 2014” (2018:32)\n\n\n“In July 2016, Canada replaced the earlier rules, imposing different requirements depending on claimants’ unemployment record and contribution payments. The new rules allow claimants to limit their availability to their previous occupation for a ‘reasonable period’ (not further defined) and at wages and conditions equal to those of their previous jobs” (2018:34)\n\n\n“In Australia, for instance, commuting up to 90 minutes each way is considered suitable” (2018:34)\n\n\n“In Canada, a new definition of suitable work no longer specifies explicit geographic mobility requirements (instead, in determining whether and how far unemployed workers can be expected to commute, claimant’s health and physical capabilities are to be considered)” (2018:34)\n\n\n“Canada and Denmark amended their list of valid reasons for refusing employment offers since 2014. In Canada, the list of valid reasons was condensed to one (if the prospective employer is affected by industrial disputes). The score assigned to Canada was lifted to a 5 accordingly.” (2018:35)\n\n\n“lower-tier benefit programmes” (2018:44)\n\n\n“focuses on the main differences of eligibility criteria between 1st-tier and lower-tier benefits, and highlights salient features of eligibility rules for lower-tier benefits in selected countries” (2018:44)\n\n\n“do not always require claimants to be available for employment as not all claimants of assistance benefits may in fact be expected to take up employment.” (2018:44)\n\n\n“that a clear majority of 25 countries requires lower-tier claimants to be available for employment” (2018:44)\n\n\n“comparing the strictness of”demanding\" elements built into unemployment benefits across countries and over time\" (2018:49)\n\n\n“Such provisions generally aim to strengthen incentives to look for, prepare for, and accept employment. They may also be used as a targeting device to reduce demands on benefit systems and employment services, by limiting support to”genuine\" or “deserving” jobseekers. Available meta-evaluations suggest that programmes featuring job-search monitoring and sanctions indeed yield positive employment effects\" (2018:49)\n\n\n“they commonly differ in two respects: Availability requirements tend to be stricter for lower-tier claimants, while sanction rules tend to be tougher for 1st-tier programmes” (2018:49)\n\n\n\n\n“How Demanding Are Activation Requirements for Jobseekers.” 2018. OECD Social, Employment and Migration Working Papers 215. Vol. 215. https://www.oecd-ilibrary.org/employment/how-demanding-are-activation-requirements-for-jobseekers_2bdfecca-en.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:24:57-05:00",
    "input_file": {}
  },
  {
    "path": "posts/fuzzy-matching/",
    "title": "Fuzzy Matching",
    "description": "Using the fuzzyjoin package for inexact matching",
    "author": [],
    "date": "2019-10-05",
    "categories": [
      "code"
    ],
    "contents": "\nRecently had the pleasure of fuzzy matching two datasets that included first and last name and date of birth. Here are some notes:\nfuzzyjoin package - great functions that do most of the heavy lifting\nstring metrics - there are a lot of ways to measure the difference in strings, selecting a metric depends on the problem\nToy Example\nlibrary(tidyverse)\nlibrary(fuzzyjoin)\nCreate our list of names and dobs.\ninside_list <- tribble(\n  ~first, ~last, ~dob,\n  \"frank\", \"johnson\", \"1980-01-01\",\n  \"debbie\", \"willis\", \"1982-01-01\"\n) %>% mutate(dob = parse_date(dob, format = \"%Y-%m-%d\"))\nCreate a second list to be matched against\noutside_list <- tribble(\n  ~first, ~last, ~dob,\n  \"frank\", \"johnson\", \"1980-01-01\",\n  \"debrah\", \"willis\", \"1982-01-02\"\n) %>% mutate(dob = parse_date(dob, format = \"%Y-%m-%d\"))\nUse the function of your choice.\nstringdist_join(outside_list, inside_list,\n                by = c(\"first\", \"last\", \"dob\"),\n                ignore_case = TRUE,\n                distance_col = \"dist\",\n                mode = \"left\",\n                method = \"lv\",\n                max_dist = 20) %>% \n  mutate(total_distance = dob.dist + first.dist + last.dist) %>% \n  select(-ends_with(\".dist\")) %>% \n  knitr::kable()\nfirst.x\nlast.x\ndob.x\nfirst.y\nlast.y\ndob.y\ndist\ntotal_distance\nfrank\njohnson\n1980-01-01\nfrank\njohnson\n1980-01-01\nNA\n0\nfrank\njohnson\n1980-01-01\ndebbie\nwillis\n1982-01-01\nNA\n14\ndebrah\nwillis\n1982-01-02\nfrank\njohnson\n1980-01-01\nNA\n14\ndebrah\nwillis\n1982-01-02\ndebbie\nwillis\n1982-01-01\nNA\n4\nYou can see the difference between debrah and debbie is 4.\nSetting the distance threshold is often a function of how exact you want the matches to be.\nSee the fuzzyjoin reference for more.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:23:26-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-employment-barriers/",
    "title": "Notes on Employment Barriers",
    "description": "A review of a research paper which offers a new way to empirically evaluate employment barriers",
    "author": [],
    "date": "2019-08-04",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nOverview\nTypes of Employment Barriers\nHighlights\n\nOverview\n(“Faces of Joblessness: Characterising Employment Barriers to Inform Policy” 2016) advances new methods to categorize employment barriers among jobseekers so as to design appropriately tailored activation responses across policy and institutional domains.\nlittle is known about specific employment barriers at the individual level, instead broad proxies are used to describe populations (NEET, older workers etc)\ninstead the authors try a bottom up approach by categorizing and measuring employment barriers\nusing latest class analysis (LDA), a clustering method, the authors find more useful groups of jobseekers who share common employment barriers by analyzing the European Union Statisitcs on Income and Living Conditions (EU SILC) available here\nTypes of Employment Barriers\nlack of work-relateed capabilities\na range of factors that may limit an individuals’ capacity to perform a specific task (e.g. lack of educations, skills or work experience, care responsibilities, or health limitations)\n\nlack of work incentives\nweak incentives to look for or accept a good job - (e.g. low pay, generous out of work benefits)\n\nlack of employment opportunities (regional)\na small number of vacancies in the labour market segment due to information asymmetries, skills mismatches, discrimination\n\nHighlights\n\n“A first step describes a series of employment-barrier indicators at the micro level, comprising three domains: work-related capabilities, financial incentives and employment opportunities” (2016:5)\n\n\n“First, standard labour-market statistics provide information about correlates of employment barriers” - “but not about employment barriers as such” - “little is known about what these individual circumstances look like or how they may translate into employment barriers that policies aim to address” - “policy discussions frequently refer to broad groupings of individuals as a short-hand” - “implicit assumption is that these groupings are useful for describing different sets of employment barriers” - “little attempt to systematically assess the specific barriers of policy clients whom AESPs are intended to help” (2016:8)\n\n\n“employment barriers that potentially drive poor labourmarket outcomes: (i) a lack of work-related capabilities, (ii) a lack of work incentives and (iii) a lack of employment opportunities” (2016:9)\n\n\n“This finding highlights the need for a careful examination of these groups as a basis for suitably targeted and tailored AESPs.” (2016:9)\n\n\n“Section 2 identifies the sample of interest: individuals with potential labour-market difficulties. Section 3 proposes empirically feasible methods for deriving indicators of different labour market barriers using the information available” (2016:9)\n\n\n“Section 4 presents the clustering exercise and discusses results. Section 5 outlines preliminary conclusions and considers possible next steps. A technical annex sets out the conceptual background and the statistical properties of the latent-class method used for the clustering exercise.” (2016:9)\n\n\n“this paper therefore includes working-age individuals who are entirely out of work (either actively searching for a job or inactive) or whose labour-market attachment is”weak\" (Figure 1). “Weak” labour-market attachment can include individuals with unstable jobs working only sporadically, those working persistently with restricted working hours, and those with very low earnings (due to, for example, being partially unpaid, or working informally)\" (2016:10)\n\n\n“We do not attempt to distinguish between voluntary and involuntary joblessness” (2016:10)\n\n\n“20 hours or less a week for one of the following reasons: illness or disability, housework or care duties, absence of other job opportunities, voluntary part-time, other reasons.” (2016:15)\n\n\n“employment-support measures should closely correspond to the specific drivers behind people’s labour-market difficulties” (2016:20)\n\n\n“If multiple barriers exist simultaneously, successful interventions are likely to require an appropriate combination, coordination and sequencing of policy measures.” (2016:20)\n\n\n“illustrations rather than an attempt at a comprehensive list of all indicators” (2016:20)\n\n\n“Individuals who would like to work may be unable to provide the type or quantity of labour that is demanded by employers. The resulting mismatch reduces their chances of finding a job, and their productivity while in employment.” (2016:22)\n\n\n“educational attainment remains strongly linked with productivity and labour market outcomes” (2016:22)\n\n\n“The highest educational attainment constitutes the preferred”skills\" indicator\" (2016:22)\n\n\n“Self-reported sickness or disability affect large parts of the working population in EU” (2016:24)\n\n\n“disability benefits are at least as common a form of out-of-work support as unemployment benefits” (2016:25)\n\n\n“Specifically, following Knudsen et al. (2010), individuals who report some or severe limitations in usual activities are characterized as having a reduced work capacity due to health iss” (2016:25)\n\n\n“Care responsibilities can be primary drivers of individuals’ inability to participate in the labour market, particularly among women” (2016:26)\n\n\n“High-intensity care-giving, in particular, is associated with low labour supply among family carer” (2016:26)\n\n\n“when income gain from taking up a job or working more is limited, because net wages are low or because generous out-of-work benefits are withdrawn as people start to work” (2016:27)\n\n\n“demand-related constraints in the respective labour market segment” (2016:31)\n\n\n“the degree of urbanisation is used instead to capture geographical differences within the country” (2016:31)\n\n\n“The probability of facing labour market constrains is estimated by means of a simple regression model for the entire reference population. The estimated parameters are then used to predict the risk of being demand constrained” (2016:32)\n\n\n“traditional regression analysis. Regression models would, e.g., show how each barrier in isolation affects the risk of facing potential labour market difficulties while holding all other barriers constant. By contrast, the proposed approach focuses on the interrelations between employment barriers and how they jointly determine observed labour-market outcomes. The focus on joint patterns of employment barriers is relevant as the success of AESPs typically depends on their ability to address real-world combinations of different labour-market obstacles.” (2016:33)\n\n\n“Tailoring policies to only the most prominent real or assumed barriers facing these groups may therefore not be sufficient for increasing their employment chances.” (2016:33)\n\n\n\n\n“Faces of Joblessness: Characterising Employment Barriers to Inform Policy.” 2016. OECD Social, Employment and Migration Working Papers 192. Vol. 192. https://www.oecd-ilibrary.org/social-issues-migration-health/faces-of-joblessness_5jlwvz47xptj-en.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:21:24-05:00",
    "input_file": {}
  },
  {
    "path": "posts/journey-to-work/",
    "title": "Journey to Work",
    "description": "A short description of the post.",
    "author": [],
    "date": "2019-03-03",
    "categories": [
      "open data"
    ],
    "contents": "\nI was inspired by David Robinson’s latest webcast in which he made a heatmap of French train delays using geom_tile and wanted to try it out for myself.\n\n\nIn this week's #tidytuesday screencast, I analyze delays in French train stations 🇫🇷🚄I show how to create heatmaps of delays (inspired by @noccaea!), and embarrass myself with even the simplest French pronunciationshttps://t.co/zBrkIkdcCz #rstats pic.twitter.com/RI7ZpxV89X\n\n— David Robinson (@drob) February 26, 2019\n\nI don’t have a lot of opportunities to use heatmaps, but recently Statcan has released their Journey to Work data as part of the 2016 Census. I wanted to see if I could use a heatmap to understand the commuting patterns in communities in southern Ontario.\nLoad packages\nlibrary(tidyverse)\nlibrary(cancensus)\nI downloaded the commuting table from statscan because I couldn’t find it using the cancensus package.\nraw_commute <- read_csv(\"~/projects/R stuff/commute/98-400-X2016391_English_CSV_data.csv\") %>% \n    janitor::clean_names() %>% \n    select(code = geo_code_por,\n           live = geo_name,\n           work = geo_name_1,\n           total = dim_sex_3_member_id_1_total_sex)\n# filter only those whose code starts w/ 35 (Ontario)\nontario_commute <- raw_commute %>% \n    filter(str_detect(code, pattern = \"^35\")) \nDownload geography data\nI was able to retrieve the working age population and census division geographies using cancensus\nlibrary(cancensus)\nlibrary(sf)\n## Linking to GEOS 3.7.0, GDAL 2.3.2, PROJ 5.2.0\n# create list of ontario census divisions to pass to cancensus\nregions_list_ontario <- list_census_regions(\"CA16\") %>% \n  filter(str_detect(region, pattern = \"^35\"))  %>% \n  as_census_region_list\n## Querying CensusMapper API for regions data...\npop_data <- get_census(\"CA16\",\n                           regions = regions_list_ontario,\n                           vectors = \"v_CA16_61\",\n                           level = \"CD\",\n                       geo_format = \"sf\", labels = \"short\") %>% \n  janitor::clean_names()\n# clean\npop_data %>% \n  mutate(working_age = v_ca16_61) %>% \n  mutate(code = as.double(geo_uid)) %>% \n  select(code, working_age, shape_area, geometry) -> pop_data_clean\nJoining the tables together\n# remove commuting within cd, compute totals\nontario_commute %>% \n  filter(live != work) %>%\n  group_by(live) %>% \n  mutate(total_commuters = sum(total),\n         prop_commuters = total / total_commuters ) %>% \n  ungroup() %>% \n  left_join(pop_data_clean, by = \"code\") %>% \n  group_by(work) %>% \n  mutate(total_commuters_destination = sum(total)) %>% \n  mutate(live_prop = total_commuters / working_age,\n         work_prop = total / working_age ) %>% \n  ungroup() -> ontario_commute_clean\nCreate visualizations\nLet’s see what visualizations will work.\nontario_commute_clean %>% \n    filter(total >= 3000) %>% \n    mutate(live = str_wrap(live, width = 15)) %>% \n    mutate(live = fct_reorder(live, total)) %>% \n    mutate(work = fct_reorder(work, total)) %>% \n    ggplot(aes(live, work, fill = total)) +\n    geom_tile(alpha = 0.7) +\n    theme_light() +\n    theme(axis.text.x = element_text(angle = 90, hjust = 1)) +\n    scale_fill_viridis_c(labels = scales::comma_format()) +\n    labs(fill = \"# of commuters\",\n         title = \"The largest number of commuters in Ontario are those who live in York, Peel and Durham who commute to Toronto for work\",\n         subtitle = \"Number of employed labour force aged 15+ who commute by Census Division - Minimum 3,000 commuters to be represented\",\n         x = \"Live - Census Division\",\n         y = \"Work - Census Division\",\n         caption = \"Data from Statistics Canada 2016 Canadian Census - Journey to Work \\n https://www12.statcan.gc.ca/census-recensement/2016/rt-td/jtw-ddt-eng.cfm\")\n\nMap the proportions\nI’m always trying to improve my mapping skills and geom_sf makes it a lot easier.\nontario_commute_clean %>% \n  filter((!live %in% c(\"Rainy River\", \"Kenora\", \"Thunder Bay\", \"Algoma\", \"Nipissing\", \n                       \"Cochrane\", \"Greater Sudbury / Grand Sudbury\", \"Manitoulin\",\n                       \"Timiskaming\", \"Sudbury\", \"Parry Sound\"))) %>% \n  ggplot() +\n  geom_sf(aes(fill = live_prop)) +\n  scale_fill_viridis_c(\"% Labour force who commute to work\", labels = scales::percent) + theme_minimal() +\n  theme(panel.grid = element_blank(),\n        axis.text = element_blank(),\n        axis.ticks = element_blank()) + \n  coord_sf(datum=NA) +\n  labs(title = \"The % of the labour force (aged 15+) who commute by Census Division in Southern Ontario\")\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:23:45-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-moral-hazard/",
    "title": "Notes on Moral Hazard",
    "description": "Review of research on moral hazard in contracting employment services",
    "author": [],
    "date": "2019-01-06",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nMoral hazard in ALMPsPrincipal-agent theory and moral hazard\n1. Incentive mechanisms\n2. Information mechanisms\n3. Control mechanisms\nSpecial expertise\nHighlights\n\nInstitutional moral hazard in Australia PESFindings\n\n\nMoral hazard in ALMPs\n(Bruttel 2005) reviews the mechanisms by which government can manage the risks (moral hazard) associated with contracting out of ALMPs using a principal-agent theory lens.\nthe author solves for the risks by advancing an integrated governance approach using 3 distinct governance mechanisms\nincentives\ninformation\ncontrol\n\nreviews 3 countries (UK, Netherlands, Australia)\nPrincipal-agent theory and moral hazard\nconcerned with how does govt (principal) ensure that service providers (agents) act in the govts interest\nmain risk is moral hazard where agents act in their own interest (maximising utility, risk avoidance etc) where principal cannot observe their actions\nmoral hazard in ALMPs revolve around 3 key areas:\ncreaming - selecting only optimal clients for service\nparking - not serving clients with low success probability\ndead-weight - serving clients who would have otherwise been successful without intervention (not explicitly mentioned but described elsewhere)\n\n1. Incentive mechanisms\noutcomes-based payments\nsplit-fee works best (fixed & outcomes) rather than threshold based (like US) so that award function is linear\nmeasured as outputs (outcomes at 13 and 26 weeks are standard) rather than inputs (clients served)\nshould optimize around under-investment i.e. skills training like Job Seeker Account (matching govt investment)\ncommon strategy to avoid moral hazard problems is to organize outcomes payments by client groups based on assessment tool (e.g. JSCI in AUS and Kansmeter in Netherlands)\n2. Information mechanisms\nbenchmarking - measure relative performance of providers\n2 types of variables: context (regional/local labour market) and jobseeker characteristics (age, duration of unemployment, skills etc)\nAustralia 5 Star model gold standard - best 60% of providers are offered contract renewal without tender\n\nmonitoring - mix of database inputs and in-person\novercome blackbox problem\nirregularities flagged automatically\n\n3. Control mechanisms\nrules and regulations (guidelines, eligibility, etc)\nquality management frameworks\nset minimum standard of service\n\ntied to monitoring and benchmarking\nSpecial expertise\nidentifies 3 types of capacities governments need\nfeasibility assessment capacity - make-or-buy decisions about services\nImplementation capacity (incentive mechanisms) tenders, selecting providers, negotiate contracts etc\nevaluation capacity (information and control) - evaluate and monitor the performance of providers\n\nHighlights\n\n“which governance mechanisms are most suitable for the contracting-out of public employment services” (Bruttel :46)\n\n\n“incentives, information, and control” (Bruttel :46)\n\n\n“incentives focus mainly on the optimal design of payment structures, information mechanisms usually make use of performance benchmarking and monitoring to increase the public purchaser’s knowledge about the private providers” (Bruttel :46)\n\n\n“First” - “control mechanisms are defined as extensive rules and regulations that state in great detail how providers have to deliver their services.” (Bruttel :46)\n\n\n“Second” - “Principal-agent theory” - “Its main focus is on the dilemma of how to make an agent (e.g. an employee or contractor) act in the interest of the principal (e.g. an employer or purchaser)” (Bruttel :47)\n\n\n“public purchaser is unable to observe the actions that a contracted private provider undertakes” - “developing governance structures that allow for a solution or at least an attenuation of this trade-off” (Bruttel :48)\n\n\n“moral hazard” - “agents which maximize their own utility to the detriment of that of the principal in situations in which their actions cannot be fully observed” (Bruttel :48)\n\n\n“three” - “incentive mechanisms” - “performance-based payments” (Bruttel :48)\n\n\n“the deficiencies of past contracting arrangements often were due to a reliance on one mechanism and a failure to understand the interdependence of all three” (Bruttel :49)\n\n\n“Employment Service Areas” (Bruttel :50)\n\n\n“selection of providers is based on two criteria: the capacity to deliver services (40%) and the capacity to achieve outcomes (60%). The capacity to deliver services is mainly an input-related factor” (Bruttel :50)\n\n\n“the capacity to achieve outcome is mainly a quantitative factor that takes into account past performance” (Bruttel :50)\n\n\n“providers have a Job Seeker Account at their disposal, which is a budget that varies according to the status of”highly disadvantaged\" and locational disadvantage and includes up to $1,150 for the first ISca period and up to $639 for the second ISca period, which starts after 24 months of unemploymen\" (Bruttel :51)\n\n\n“there is a training account of up to $584 which is available for older jobseekers and indigenous jobseekers” (Bruttel :51)\n\n\n“Because the public vacancy database depends exclusively on input from the providers (and employers), providers are paid a job placement fee (up to $401) if a jobseeker is placed in a vacancy that was listed on the national vacancy database by the provider.” (Bruttel :51)\n\n\n“outcome-related payments are the single most important governance mechanism to align the interests of the private providers with those of the public purchaser” - “Thus, providers face constant marginal incentives because the award function is linear, like that in a piece-rate compensation function” (Bruttel :54)\n\n\n“the trade-off between optimal incentive contracts and the risk aversion of the providers” - “Former indicators for controlling were often related to inputs” (Bruttel :56)\n\n\n“Employment durations of 13 and 26 weeks have emerged internationally as major milestones because they are useful indicators” (Bruttel :56)\n\n\n“Hence, the greater their contribution to the placement of a jobseeker; the higher their payment should be. However, it is very difficult to measure the net impact of treatment on an individual client.” - “However, by only taking into account the gross results, the government implicitly assumes that the impact is constant for all jobseekers.” (Bruttel :58)\n\n\n“differentiate payments according to target groups” (Bruttel :58)\n\n\n“Kansmeter” (Bruttel :58)\n\n\n“Major problems are that clients do not reveal their true situation because benefit assessment and profiling are carried out in the same interview, and that the time frame is too limited” - “there is also a structural problem in that the target groups are defined very broadly and in many cases are not optimally linked to the profiling instruments” (Bruttel :58)\n\n\n“Following this assessment, the number of monitoring visits is fixed and may vary from one per year to up to four and more if it is a new site from a new provider or if problems have occurred in the past” (Bruttel :60)\n\n\n“The basic trade-off is between the higher accountability of providers for their outcomes on the one hand and the freedom that they want to have in order to achieve these outcomes given their greater responsibilities” - “(in particular financial responsibilities) on the other hand.” (Bruttel :62)\n\nInstitutional moral hazard in Australia PES\nFindings\n(Luigjes and Vandenbroucke 2015) outlines how Austrialia moved from a blackbox approach to contracting out employment services towards a regime of minimum requirements and monitoring\nreforms of the blackbox approach included:\nnew tendering processes (see above)\n5 Star rating system for providers\nadjustment of provider responsibilities\nstandardization of work process\n\nrelationship between govt & providers has been rocky as flexibility has been reduced\nproblems were creaming and parking\n3 streams of service\nstream A - job competitive\nstream B - vocational issues\nstream C - series non-vocational issues via referral\n\nDenmark devolved employment services to municipalities\nWork for the Dole targets long term barriered clients in an attempt to overcome parking (re-vamp of JCP?)\nthe KPIs, outcomes based model also includes a bonus if referred to training\noutcomes are based on location, stream and expediency (how fast) clients move to outcomes.\n\n\n\n\nBruttel, Oliver. 2005. “Contracting-Out and Governance Mechanisms in the Public Employment Service.” Working Paper SP I 2005-109. WZB Discussion Paper. https://www.econstor.eu/handle/10419/44013.\n\n\nLuigjes, Chris, and Frank Vandenbroucke. 2015. “Institutional Moral Hazard in the Multi-Tiered Regulation of Unemployment in Australia - Background Paper.” SSRN Scholarly Paper ID 2958261. Rochester, NY: Social Science Research Network. https://papers.ssrn.com/abstract=2958261.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:21:37-05:00",
    "input_file": {}
  },
  {
    "path": "posts/notes-on-outcomes-in-labour-market-programs/",
    "title": "Notes on Outcomes in Labour Market Programs",
    "description": "A review of research that examines outcomes in labour market programs",
    "author": [],
    "date": "2019-01-01",
    "categories": [
      "policy research"
    ],
    "contents": "\n\nContents\nEI related servicesFindings\nHighlights\n\nOntario WorksFindings\nHighlights\n\n\nEI related services\nHandouyahia, 2016\nHandouyahia (see Handouyahia et al., n.d.) uses admin data matched to CRA they find that EBSMs have positive effects on employment and earnings\nFindings\nEBSMs caused gains in employment earnings, incidence of employment (+2.4% first year to +4.4% by fifth year) and reduction of EI benefits after completing\nSD had most pronounced effect (between $204 and $4,059 higher)\nSD represents the largest incremental gains\nHighlights\n\n“The study examines the impacts of Employment Benefits such as EAS, SD and TWS by comparing individuals who received these interventions to those who did not participate.” (Handouyahia et al :9)\n\n\n“two groups with the same probability of participation will show up in the participant and non-participant samples in equal proportions” (Handouyahia et al :9)\n\n\n“The use of standard personal characteristics, pre-treatment outcomes, transitions between different labour market states, regional information and labour market history is very important for decreasing the likelihood of biased estimator of the true treatment effect.” (Handouyahia et al :9)\n\n\n“For example, factors such as ability, health, education and motivation to seek employment were not directly measured except to the extent they were captured in prior income and labour market attachment patterns.” (Handouyahia et al :10)\n\n\n“on earnings and the probability of employment for participants” (Handouyahia et al :11)\n\n\n“SD is effective at increasing the employment earnings and incidence of employment for active claimants. Importantly, for active claimants, participation in SD led to the largest incremental gains in employment earnings among all EBSMs” (Handouyahia et al :12)\n\nOntario Works\nAdams et. al (see Adams, Chow, and Rose 2018) examine Ontario Works employment programming\nhow effective are OW ALMPs on two outcomes:\ncase duration (benefit ‘spell’ measured in months)\nprobability of returning to OW within 1 or 2 years of exit\n\nthis client group has weaker LM attachment and so not perfectly aligned to existing literature on ALMPs\naccordingly existing canadian work suggests this group is differentially affected by ALMPs\nFindings\nplacement services extend OW spells by 16 months\nstructured job search not having an effect on ‘return’\ntraining programs (literacy, skills/vocational) does reduce ‘return’ by 07% year 1 and 1.1% year 2\namong all interventions there’s a trade-off between short and long term effectiveness\nplacement means longer spells but reduces P(return) by 7% in year 1 and 10% year 2\nstructured job search reduces spell by 1.5 - 3 months but doesn’t affect P(return)\ntraining program alone is more effective in the short-term than assignment to boht training program and structured job-search (implying the interventions aren’t additive)\n\nHighlights\n\n“a significant differential impact on both spell durations (time on social assistance) and one and two-year return rates (return to social assistance)” (Adams et al 2018:1)\n\n\n“Examining the program effects on spell duration gives an idea of the short-term efficacy of the programs: how effective they are at getting recipients employed.” (Adams et al 2018:2)\n\n\n“outcomes depend on the type of assistance provided.” (Adams et al 2018:2)\n\n\n“while a combination of such workshops and training or employment assistance through direct job placements increase the spell length, direct job placements have a statistically significant and economically meaningful effect on reducing the oneand two-year return rates.” (Adams et al 2018:3)\n\n\n“For example, the government could increase assignment to programs that lead to shorter spell durations if its goal was to get recipients off social assistance more quickly. Alternatively, it could increase assignment to programs that lead to lower probabilities of return to social assistance if its aim was focused more on longer-term labour-market attachment.” (Adams et al 2018:3)\n\n\n“the positive impact of programs such as jobtraining tends to be larger for the long-term unemployed (this would include Ontario Works recipients) and that many treatments that do not show short-term evidence of a statistically significant impact show positive mediumterm impacts.” (Adams et al 2018:3)\n\n\n“all three lead to statistically significant increases in employment compared to a control group of untreated EI claimants, with the effects becoming more pronounced over the medium term” (Adams et al 2018:4)\n\n\n“this study is the first to examine their impact on recipients of social assistance.” (Adams et al 2018:4)\n\n\n“Many OW beneficiaries may have been ineligible to claim EI benefits following a job separation, and a common reason for joining OW is the exhaustion of EI benefits. The work of Brown and Koettl (2015) and Card, Kluve, and Weber (2010, 2015) suggests that this group could be differentially affected by these programs, so it follows that any policy aimed at improving the labour-market outcomes of social assistance beneficiaries should be based on evidence that is pertinent to them.” (Adams et al 2018:4)\n\n\n“The return rates for each program give the proportion of recipients that return to social assistance within, respectively, one year of leaving and two years of leaving.” (Adams et al 2018:8)\n\n\n“independent job-search program or placement services are, on average, more likely to return to social assistance within one year or two years after exit. By contrast, those assigned to structured job search, training programs, or both have a lower propensity of returning to unemployment after leaving Ontario Work” (Adams et al 2018:8)\n\n\n“Being assigned to structured job search will, on average, reduce spell duration by approximately 1.7 months compared to recipients assigned to independent job search.” (Adams et al 2018:9)\n\n\n“However, being assigned to both these program categories (structured job search and a training program) adds 4.6 months to a spell - a significantly longer period than after assignment to only one of the programs.” (Adams et al 2018:9)\n\n\n“The average recipient is better off being assigned only to a training program rather than also being assigned to structured job search, or vice versa.” (Adams et al 2018:9)\n\n\n“being given a direct job or volunteer placement has a negative impact on spell duration relative tto independent job search, adding 16.6 months to the average spell on social assistance. By this measure, direct placements are the least effective of the treatments studied in the short term.” (Adams et al 2018:10)\n\n\n“The results show that being assigned to structured job search does not have a statistically significant effect on the probability of return within one year or two years.” (Adams et al 2018:10)\n\n\n“a training program has a small statistically significant effect, reducing the return probabilities by 0.7 percent within one year and by 1.1 percent in two years.” (Adams et al 2018:10)\n\n\n“It should be noted that assignment to either structured job search or a training program alone is more effective (by the measures of efficacy examined here) than assignment to both these programs; in this case, more is not better.” (Adams et al 2018:10)\n\n\n“it is possible to improve outcomes for recipients of social assistance in Ontario by emphasizing programs that are more effective in meeting objectives.” (Adams et al 2018:10)\n\n\n\n\nAdams, Jason, Ken Chow, and David Rose. 2018. “Assessing Active Labour-Market Programs: How Effective Is Ontario Works?” SSRN Electronic Journal. https://doi.org/10.2139/ssrn.3276081.\n\n\nHandouyahia, Andy, Stéphanie Roberge, Yves Gingras, Tony Haddad, and Georges Awad. n.d. “Estimating the Impact of Active Labour Market Programs Using Administrative Data and Matching Methods,” 7.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:21:57-05:00",
    "input_file": {}
  },
  {
    "path": "posts/exploring-health-inspection-reports/",
    "title": "Exploring Health Inspection Reports",
    "description": "A brief examination of health inspection reports in Algoma region",
    "author": [],
    "date": "2018-01-28",
    "categories": [
      "open data"
    ],
    "contents": "\nAlgoma Public Health is the public health agency in my area that inspects restaurants to ensure they are abiding by all the relevant food safety legislation. They are also nice enough to publish their restaurant health inspection reports online for anyone to review.\nI searched for a few restaurants that I frequent (phew Fratellis is safe!) but then I wanted to know which restaurants had the most health infractions?\nTheir website isn’t setup to answer that kind of question. Each inspection report is published as a unique page on their website which makes aggregating and comparing difficult.\nI used rvest to scrape the URLs of all the reports APH published. Then I scraped the contents of the reports so that I could create a dataset that would allow me to aggregate and compare the results (the dataset and code available here.)\nRestaurants with the most infractions\nOf the 90% of restaurants who received three visits, here are the top 5 in terms of total number of infractions:\n\nSurprising results. Upper Deck has some particularly bad health infractions.\nBut that got me thinking–not all infractions are equal. Some are minor and are corrected onsite. Some are more serious and others still are downright strange. Let’s take a closer look.\nNumber of infractions\nHere are the top 10 infractions by frequency, meaning these infractions appear most often in the dataset.\n\nStranger Infractions\nThe infractions that don’t appear frequently are also quite interesting. Here are infractions that only appear once in the dataset, but leave me with more questions than answers.\nRestaurant\nAddress\nDate\nInfraction\nJuicy Beatz & Healthy Eatz\n235 McNabb Street\n2017-08-23\nFood handler hygiene\nPauline’s Place\n923 Queen Street\n2017-11-28\nOnly Grade A or B eggs permitted\nQueen West Variety\n602 Queen Street\n2016-12-16\nExclusion of live animals on the premises, subject to exemptions\nRoberta Bondar Pavilion Serving Kitchens\n65 Foster Dr\n2016-08-30\nNo room with food used for sleeping purposes\nTeen Challenge Kitchen\n1446 Great Northern Road\n2016-12-13\nUninspected meats obtained through hunting: only for custom cutting, wash/rinse/sanitize equipment after use as prescribed\nQuestions that come to mind:\nwho’s sleeping in the Pavilion?\ndid the Teen Challenge involve catching your meal?\nwhat kind of animals are hanging out in Queen West Variety?\nhow does one tell the grade of eggs? Can you do it just by looking?\nWhat does this data tell us? Not too much really :)\nI hope you enjoyed this peek behind the health inspection curtain. The dataset and code are available here. If you have any questions or comments, please feel free to get in touch.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-01T22:23:10-05:00",
    "input_file": {}
  }
]
